Friends | List of all members
ACAPI::MEP::v1::CableCarrierPreferenceTableContainer Class Referencefinal
MEP Element Manager
The CableCarrierPreferenceTableContainer can contain several PreferenceTableBase associated with cable carriers. More...
#include <MEPCableCarrierPreferenceTableContainer.hpp>
 Inheritance diagram for ACAPI::MEP::v1::CableCarrierPreferenceTableContainer:
 Friends
Result< CableCarrierPreferenceTableContainer >  | GetCableCarrierPreferenceTableContainer ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< UniqueID >  | AddNewTable (GS::UniString tableName)
Inserts a new preference table into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a preference table from the container.
 Protected Member Functions inherited from ACAPI::MEP::v1::PreferenceTableContainerBase
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl >)
Modifier (PreferenceTableContainerBase &)
Detailed Description
The CableCarrierPreferenceTableContainer can contain several PreferenceTableBase associated with cable carriers.
Since
Archicad 27
The container is already initialized (but may be empty) and you can access it by calling GetCableCarrierPreferenceContainer.
Example code snippet from Test / New MEP
Take a look at PreferenceTableContainerBase
Friends And Related Symbol Documentation
◆ GetCableCarrierPreferenceTableContainer
 Result< CableCarrierPreferenceTableContainer > GetCableCarrierPreferenceTableContainer  |  ( |   | )
friend
Returns
If able, returns the CableCarrierPreferenceTableContainer from the project.